It is assumed that the mean systolic blood pressure is Œº = 120 mm Hg. In the Honolulu Heart Study, a sample of n = 100 people had an average systolic blood pressure of 130.1 mm Hg with a standard deviation of 21.21 mm Hg. Is the group significantly different (with respect to systolic blood pressure!) from the regular population?

In [2]:
import numpy as np
import pandas as pd
import scipy.stats as stats
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [2]:
n = 100 # > 30 -> Normal distribution
# Ho: \mu = 120
# Ha: mean != 120

sample_mean = 130.1
pop_mean = 120
pop_std_dev = 21.21

In [3]:
z = ( sample_mean - pop_mean ) / ( pop_std_dev / np.sqrt(n) )
print("Our z score is: {:.2f}".format(z))

Our z score is: 4.76

Let's set the confidence level to 95% = 0.95

Two sided: Ha: ùúá‚â†100

In [4]:
zc = stats.norm.ppf(1-(0.05/2))
print("Our zc score is: {:.2f}".format(zc))

Our zc score is: 1.96

conculsion: we reject the null hypothesis. average blood pressure differes from 120

Optional
In a packing plant, a machine packs cartons with jars. It is supposed that a new machine will pack faster on the average than the machine currently used. To test that hypothesis, the times it takes each machine to pack ten cartons are recorded. The results, in seconds, are shown in the tables in the file Data/machine.txt. Assume that there is sufficient evidence to conduct the t test, does the data provide sufficient evidence to show if one machine is better than the other.

In [5]:
n = 10 # < 30 -> student distribution
file1 = pd.read_csv('Data/Data_Machine.txt')
machine=file1
machine

  New Machine\t  Old Machine
0         42.1\t        42.7
1         41\t          43.6
2         41.3\t        43.8
3         41.8\t        43.3
4         42.4\t        42.5
5         42.8\t        43.5
6         43.2\t        43.1
7         42.3\t        41.7
8           41.8\t        44
9         42.7\t        44.1

In [4]:
df = pd.DataFrame({'New Machine': [42.1, 41,
                            41.3,41.8,42.4,42.8,43.2,42.3,41.8,42.7],
                 'Old Machine':[42.7, 43.6, 43.8,43.3,42.5,43.5,43.1,41.7,44,44.1]})
df

   New Machine  Old Machine
0         42.1         42.7
1         41.0         43.6
2         41.3         43.8
3         41.8         43.3
4         42.4         42.5
5         42.8         43.5
6         43.2         43.1
7         42.3         41.7
8         41.8         44.0
9         42.7         44.1